socketio-chat-load-test.yaml
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

config:
  target: "172.17.0.1"
  tcp:
    port: 10100
  phases:
    - arrivalCount: 1000
      duration: 1
  engines:
    tcp: {}
  processor: "./functions.js"

scenarios:
  - name: "Simple load"
    weight: 100
    engine: "tcp"
    flow:
      - function: "setImei"
      - send:
          payload: "{{ imei }}"
          encoding: 'hex'
      - think: 1
      - count: 50
        loop:
        - function: "setRequest"
        - send:
            payload: "{{ request }}"
            encoding: 'hex'
        - think: 1